[
    {
        "id":1,
        "name":"Python",
        "description":"Python is a high-level,and most popular general-purpose and a very popular programming language. Python programming language (latest Python 3) is being used in web development, Machine Learning applications, along with all cutting edge technology in Software Industry. Python Programming Language is very well suited for Beginners, also for experienced programmers with other programming languages like C++ and Java.",
        "image":"https://i.ibb.co/rbRfcm5/images.jpg",
        "total_view": 10,
        "price": "10"

    },
    {
        "id":2,
        "name":"C",
        "description":"C language is mostly considered as the mother language of all the modern programming languages because most of the compilers, JVMs, Kernels, etc. are written in C language, and most of the programming languages follow C syntax, for example, C++, Java, C#, etc.",
        "image":"https://i.ibb.co/Rym44Sq/0-tc5h-Gik294-F0-Omb-C.jpg",
        "total_view": 10,
        "price": "10"

    },
    {
        "id":3,
        "name":"JavaScript",
        "description":"JavaScript (JS) is a lightweight, interpreted, or just-in-time compiled programming language with first-class functions. While it is most well-known as the scripting language for Web pages, many non-browser environments also use it, such as Node.js, Apache CouchDB and Adobe Acrobat. JavaScript is a prototype-based, multi-paradigm, single-threaded, dynamic language, supporting object-oriented, imperative, and declarative (e.g. functional programming) styles.",
        "image":"https://i.ibb.co/1TtSwbx/Java-Script-logo.png",
        "total_view": 10,
        "price": "10"

    },
    {
        "id":4,
        "name":"C++",
        "description":"C++ pronounced is a high-level recomended general-purpose programming language created by Danish computer scientist Bjarne Stroustrup as an extension of the C programming language, or . The language has expanded significantly over time, and modern C++ now has object-oriented, generic, and functional features in addition to facilities for low-level memory manipulation. It is almost always implemented as a compiled language, and many vendors provide C++ compilers, including the Free Software Foundation, LLVM, Microsoft, Intel, Embarcadero, Oracle, and IBM, so it is available on many platforms",
        "image":"https://i.ibb.co/bK7jztg/where-to-get-c-programming-help-at-a-reasonable-price.png",
        "total_view": 10,
        "price": "10"

    },
    {
        "id":5,
        "name":"Java",
        "description":"Java is a powerful laguage general-purpose programming language. It is used to develop desktop and mobile applications, big data processing, embedded systems, and so on. According to Oracle, the company that owns Java, Java runs on 3 billion devices worldwide, which makes Java one of the most popular programming languages.",
        "image":"https://i.ibb.co/3RG3W9C/cb88-java-logo-001.jpg",
        "total_view": 10,
        "price": "10"

    },
    {
        "id":6,
        "name":"PHP",
        "description":"PHP is a general-purpose scripting language geared toward web development.[5] It was originally created by Danish-Canadian programmer Rasmus Lerdorf in 1993.[6] The PHP reference implementation is now produced by The PHP Group.[7] PHP originally stood for Personal Home Page,[8] but it now stands for the recursive initialism PHP: Hypertext Preprocessor",
        "image":"https://i.ibb.co/VHHXn6s/Core-PHP-Tutorial.png",
        "total_view": 10,
        "price": "10"

    },
    {
        "id":7,
        "name":"Go",
        "description":"Go is a statically typed, compiled programming language designed at Google[11] by Robert Griesemer, Rob Pike, and Ken Thompson.[12] It is syntactically similar to C, but with memory safety, garbage collection, structural typing,[6] and CSP-style concurrency.[13] It is often referred to as Golang because of its former domain name, golang.org, but its proper name is Go",
        "image":"https://i.ibb.co/gSqd0Yh/golang.png",
        "total_view": 10,
        "price": "10"

    }
    
]